tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
#include <stdint.h>
#include <stdarg.h>
#include <stdlib.h>
#include "stm32f1xx.h"
#include "globals.h"
#include "main.h"
#include "libdivide.h"

// led
#define LED_DELAY_MS        128
#define LED_PORT            GPIOC
#define LED_CR              CRH
#define LED_SET             GPIO_BSRR_BS13
#define LED_RESET           GPIO_BSRR_BR13
#define LED_PORT_RESET_BITS GPIO_CRH_MODE13 | GPIO_CRH_CNF13
#define LED_PORT_SET_BITS   GPIO_CRH_MODE13_1 | GPIO_CRH_MODE13_0
#define LED_CLOCK           RCC_APB2ENR_IOPCEN

// usart defines
#define USART_BAUD          115200
#define USART_BUFFER_SIZE   16

// delay defines
#define USART_DELAY_MS      8
#define POS_DELAY_MS		128

#define PRINT_BUF_LEN 64

typedef enum
{
    led_idle = 0, led_on, led_off
} led_state_t;

volatile led_state_t    led_state       = led_idle;
volatile led_state_t    led_state_next  = led_on;
volatile uint16_t       led_delay_count = 0;

typedef enum
{
    usart_idle = 0, usart_send
} usart_state_t;

typedef struct {
    uint8_t buffer[USART_BUFFER_SIZE];
    uint8_t head_pos;
    uint8_t tail_pos;
} rx_buffer_t;

volatile usart_state_t  usart_state         = usart_idle;
volatile uint16_t       usart_delay_count   = 0;
volatile rx_buffer_t    uart_buffer         = { {0}, 0, 0 };

volatile uint16_t       pos_delay_count   = 0;


//-----------------------------------------------------------------
// controller state, initialized to sane values in init_constants()
//-----------------------------------------------------------------

static int32_t error_state_out_of_sync = 0;
static int32_t error_index_offset = 0;

static int64_t absolute_pos = 0;
static int64_t absolute_idx = 0;
static int32_t absolute_tick = 0;

static int32_t current_index_delta = 0;
static int32_t current_rpm = 0; 

static int32_t wait_for_index_zero = 0;
static int32_t index_zero_occured = 0;

static int64_t absolute_pos_start_offset = 0;

static int64_t stepper_actual_pos_z = 0;
static int32_t stepper_dir_z = 0;

static int32_t stepper_follow_mul_z = 0;
static int32_t stepper_follow_div_z = 0;
static libdivide::libdivide_s64_t stepper_follow_div_z_opt;

static int32_t stepper_jog_dir_z = 0;
static int32_t stepper_jog_tck_z = 0;
static int32_t stepper_jog_tim_z = 0;

static int64_t stepper_actual_pos_x = 0;
static int32_t stepper_dir_x = 0;

static int32_t stepper_follow_mul_x = 0;
static int32_t stepper_follow_div_x = 0;
static libdivide::libdivide_s64_t stepper_follow_div_x_opt;

static int32_t stepper_jog_dir_x = 0;
static int32_t stepper_jog_tck_x = 0;
static int32_t stepper_jog_tim_x = 0;

enum run_mode {
	run_mode_none,
	
	run_mode_follow_z,
	run_mode_follow_x,
	run_mode_follow_zx,
	
	run_mode_jog_z,
	run_mode_jog_x,
	run_mode_jog_zx
};

static run_mode current_run_mode = run_mode_follow_zx;

//-----------------------------------------------------------------

static void put_char(uint8_t byte)
{
    if(byte == '\n') {
        put_char('\r');
    }
    USART1->DR = (int)(byte);
    while (!(USART1->SR & USART_SR_TXE));
}

static void buffer_char(uint8_t c)
{
    int i = (uart_buffer.head_pos + 1) % USART_BUFFER_SIZE;
    
    if (i != uart_buffer.tail_pos)
    {
        uart_buffer.buffer[uart_buffer.head_pos] = c;
        uart_buffer.head_pos = i;
    }
}

static uint8_t get_char(uint8_t *c)
{
    // if head_pos = tail_pos, there are no characters in buffer
    if(uart_buffer.head_pos == uart_buffer.tail_pos)
        return 0;
    
    // put char from buffer into var pointed to by c
    *c = uart_buffer.buffer[uart_buffer.tail_pos];
    uart_buffer.tail_pos = (uart_buffer.tail_pos + 1) % USART_BUFFER_SIZE;
    
    return 1;
}

static void set_current_run_mode(run_mode run_mode);

static void parse(void) {
	static char buffer[256];
	static int32_t buffer_pos = 0;

    uint8_t in_char;
    if(get_char(&in_char)) {
        switch(in_char)
        {
            case 0x0D: {
            		switch(buffer[0]) {
            			case	'F': {
            						if (buffer_pos > 1) switch (buffer[1]) {	
            							case	'X': {
            										set_current_run_mode(run_mode_follow_x);
            									} break;
            							case	'Z': {
            										set_current_run_mode(run_mode_follow_z);
            									} break;
            							case	'B': {
            										set_current_run_mode(run_mode_follow_zx);
            									} break;
            						}
            					} break;
            			case	'J': {
            						if (buffer_pos > 1) switch (buffer[1]) {	
            							case	'X': {
													if (buffer_pos > 2) switch (buffer[2]) {
														case	'F': {
																	stepper_jog_dir_x = +1;
																}break;
														case	'R': {
																	stepper_jog_dir_x = -1;
																}break;
													}
            										set_current_run_mode(run_mode_jog_x);
            									} break;
            							case	'Z': {
													if (buffer_pos > 2) switch (buffer[2]) {
														case	'F': {
																	stepper_jog_dir_z = +1;
																}break;
														case	'R': {
																	stepper_jog_dir_z = -1;
																}break;
													}
            										set_current_run_mode(run_mode_jog_z);
            									} break;
            							case	'B': {
													if (buffer_pos > 2) switch (buffer[2]) {
														case	'F': {
																	stepper_jog_dir_z = +1;
																}break;
														case	'R': {
																	stepper_jog_dir_z = -1;
																}break;
													}
													if (buffer_pos > 2) switch (buffer[3]) {
														case	'F': {
																	stepper_jog_dir_x = +1;
																}break;
														case	'R': {
																	stepper_jog_dir_x = -1;
																}break;
													}
            										set_current_run_mode(run_mode_jog_zx);
            									} break;
            						}
            					} break;
            			case	'N': {
									set_current_run_mode(run_mode_none);
            					} break;
            		}
            		buffer_pos = 0;
                } break;
            default: {
					if (buffer_pos < 255 ) {
						buffer[buffer_pos++] = in_char;
					}
                } break;
        }
    }
}

static void simple_outputchar(char **str, char c)
{
	if (str) {
		**str = c;
		++(*str);
	} 
	else {
		put_char(c);
	}
}

enum flags {
	PAD_ZERO	= 1,
	PAD_RIGHT	= 2,
};

static int prints(char **out, const char *string, int width, int flags)
{
	int pc = 0, padchar = ' ';

	if (width > 0) {
		int len = 0;
		const char *ptr;
		for (ptr = string; *ptr; ++ptr) ++len;
		if (len >= width) width = 0;
		else width -= len;
		if (flags & PAD_ZERO)
			padchar = '0';
	}
	if (!(flags & PAD_RIGHT)) {
		for ( ; width > 0; --width) {
			simple_outputchar(out, padchar);
			++pc;
		}
	}
	for ( ; *string ; ++string) {
		simple_outputchar(out, *string);
		++pc;
	}
	for ( ; width > 0; --width) {
		simple_outputchar(out, padchar);
		++pc;
	}

	return pc;
}

static int simple_outputi(char **out, int i, int base, int sign, int width, int flags, int letbase)
{
	char print_buf[PRINT_BUF_LEN];
	char *s;
	int t, neg = 0, pc = 0;
	unsigned int u = i;

	if (i == 0) {
		print_buf[0] = '0';
		print_buf[1] = '\0';
		return prints(out, print_buf, width, flags);
	}

	if (sign && base == 10 && i < 0) {
		neg = 1;
		u = -i;
	}

	s = print_buf + PRINT_BUF_LEN-1;
	*s = '\0';

	while (u) {
		t = u % base;
		if( t >= 10 )
			t += letbase - '0' - 10;
		*--s = t + '0';
		u /= base;
	}

	if (neg) {
		if( width && (flags & PAD_ZERO) ) {
			simple_outputchar (out, '-');
			++pc;
			--width;
		}
		else {
			*--s = '-';
		}
	}

	return pc + prints (out, s, width, flags);
}


static int simple_vsprintf(char **out, const char *format, va_list ap)
{
	int width, flags;
	int pc = 0;
	char scr[2];
	union {
		char c;
		char *s;
		int i;
		unsigned int u;
		void *p;
	} u;

	for (; *format != 0; ++format) {
		if (*format == '%') {
			++format;
			width = flags = 0;
			if (*format == '\0')
				break;
			if (*format == '%')
				goto out;
			if (*format == '-') {
				++format;
				flags = PAD_RIGHT;
			}
			while (*format == '0') {
				++format;
				flags |= PAD_ZERO;
			}
			if (*format == '*') {
				width = va_arg(ap, int);
				format++;
			} else {
				for ( ; *format >= '0' && *format <= '9'; ++format) {
					width *= 10;
					width += *format - '0';
				}
			}
			switch (*format) {
				case('d'):
					u.i = va_arg(ap, int);
					pc += simple_outputi(out, u.i, 10, 1, width, flags, 'a');
					break;

				case('u'):
					u.u = va_arg(ap, unsigned int);
					pc += simple_outputi(out, u.u, 10, 0, width, flags, 'a');
					break;

				case('x'):
					u.u = va_arg(ap, unsigned int);
					pc += simple_outputi(out, u.u, 16, 0, width, flags, 'a');
					break;

				case('X'):
					u.u = va_arg(ap, unsigned int);
					pc += simple_outputi(out, u.u, 16, 0, width, flags, 'A');
					break;

				case('c'):
					u.c = va_arg(ap, int);
					scr[0] = u.c;
					scr[1] = '\0';
					pc += prints(out, scr, width, flags);
					break;

				case('s'):
					u.s = va_arg(ap, char *);
					pc += prints(out, u.s ? u.s : "(null)", width, flags);
					break;
				default:
					break;
			}
		}
		else {
out:
			simple_outputchar (out, *format);
			++pc;
		}
	}
	if (out) **out = '\0';
	return pc;
}

