tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
static int simple_printf(const char *fmt, ...)
{
	va_list ap;
	int r;

	va_start(ap, fmt);
	r = simple_vsprintf(0, fmt, ap);
	va_end(ap);

	return r;
}

#ifdef __cplusplus
extern "C" {
#endif  // #ifdef __cplusplus

void HardFault_Handler(void)
{
	for (;;) {
		LED_PORT->BSRR  = LED_RESET;
	}
}

void BusFault_Handler(void)
{
	for (;;) {
		LED_PORT->BSRR  = LED_RESET;
	}
}

void SysTick_Handler(void)
{
	absolute_tick++;
	
	parse();

    // update heartbeat LED delay counter and toggle state when needed
    led_delay_count = ( (led_delay_count + 1) % LED_DELAY_MS );
    if(led_delay_count == 0) {
        led_state       = led_state_next;
        led_state_next  = led_idle;
    }

    // update the usart counter and change state if needed
    usart_delay_count = ( (usart_delay_count + 1) % USART_DELAY_MS );
    if(usart_delay_count == 0) {
        usart_state       = usart_send;
    }

    pos_delay_count = ( (pos_delay_count + 1) % POS_DELAY_MS );
    if(pos_delay_count == 0) {
		current_rpm = 60000 / current_index_delta;

		int16_t cnt = TIM3->CNT;
	    simple_printf("g: %d s: %d i: %d r: %d s: %d\n", (int32_t)(absolute_pos + cnt), (int32_t)stepper_actual_pos_z, (int32_t)absolute_idx, current_rpm, (int32_t)SystemCoreClock);

		if (error_state_out_of_sync) {
			simple_printf("error: out of sync!\n");
			error_state_out_of_sync = 0;
		}

		if (error_index_offset) {
		    simple_printf("index error offset %d\n", error_index_offset);
			error_index_offset = 0;
		}
    }
}

void USART1_IRQHandler(void)
{
    if(USART1->SR & USART_SR_ORE) {
        // process overrun error if needed
    }
    
    // get character from data reg
    uint8_t in_char = (USART1->DR & 0xFF);

    buffer_char(in_char);
}

void EXTI1_IRQHandler(void)
{
	// Core critical section, nothing shall happen here
	__disable_irq();
	int16_t cnt = TIM3->CNT;
	TIM3->CNT = 0;

	absolute_pos += cnt;
	if (cnt < 0) {
		absolute_idx--;
	} else {
		absolute_idx++;
	}

	EXTI->PR |= EXTI_PR_PR1;

	if (cnt != 3 && cnt != -3 &&
		cnt != 2880 && cnt != -2880) {
		error_index_offset = (int32_t)cnt;
	}
	
	if (cnt == 2880 || cnt == -2880) {
		index_zero_occured = 1;
	}

	static int32_t last_absolute_tick = 0;
	current_index_delta = abs(absolute_tick - last_absolute_tick);
	last_absolute_tick = absolute_tick;
	__enable_irq();
}

void TIM2_IRQHandler(void)
{
	if ((TIM2->SR & TIM_SR_UIF)) {
		TIM2->SR &= ~(TIM_SR_UIF);

		// Do nothing if we are in stop sync mode
		if (current_run_mode == run_mode_none) {
			return;
		}
		
		// Protect against TIM3 IRQ race
		__disable_irq();
		int16_t cnt = TIM3->CNT;
		int64_t absolute_actual_pos = absolute_pos;
		__enable_irq();

		absolute_actual_pos += cnt - absolute_pos_start_offset;

		if (wait_for_index_zero) {
			if (index_zero_occured) {
				wait_for_index_zero = 0;
				absolute_pos_start_offset = absolute_actual_pos - cnt;
			} else {
				// Do nothing until we hit index zero
				return;
			}
		}

		static uint32_t flip_z = 0;
		if (flip_z) {

			// by default, don't move
			int64_t stepper_target_pos_z = stepper_actual_pos_z;

			switch (current_run_mode) {
				case	run_mode_follow_zx:
				case	run_mode_follow_z: {
							stepper_target_pos_z = libdivide::libdivide_s64_do(absolute_actual_pos * stepper_follow_mul_z, &stepper_follow_div_z_opt);
						} break;
				case	run_mode_jog_zx:	
				case	run_mode_jog_z:	{
							stepper_target_pos_z = stepper_actual_pos_z;
							if (--stepper_jog_tck_z <= 0) {
								// Reset
								stepper_jog_tck_z = stepper_jog_tim_z;
								// Advance
								if (stepper_jog_dir_z < 0) {
									stepper_target_pos_z --;
								}
								if (stepper_jog_dir_z > 0) {
									stepper_target_pos_z ++;
								}
							}
						} break;
				default: {
						} break;
			}
			
			int32_t szdelta = (int32_t)(stepper_target_pos_z - stepper_actual_pos_z);

			if (abs(szdelta) >= 2880) {
				error_state_out_of_sync = szdelta;
			}

			if (szdelta == 0) {
				// nop
			} else if (szdelta < 0) {
				if (stepper_dir_z != -1) {
					stepper_dir_z = -1;
					GPIOB->BSRR = GPIO_BSRR_BR14;
					// wait until next cycle to do the pulse
				} else {
					stepper_actual_pos_z--;
					GPIOB->BSRR = GPIO_BSRR_BS13;
					flip_z ^= 1;
				}
			} else if (szdelta > 0) {
				if (stepper_dir_z != +1) {
					stepper_dir_z = +1;
					GPIOB->BSRR = GPIO_BSRR_BS14;		
					// wait until next cycle to do the pulse
				} else {
					// now do the actual pulse
					stepper_actual_pos_z++;
					GPIOB->BSRR = GPIO_BSRR_BS13;
					flip_z ^= 1;
				}
			}
		} else {
			GPIOB->BSRR = GPIO_BSRR_BR13;
			flip_z ^= 1;
		}

		static uint32_t flip_x = 0;
		if (flip_x) {
			int64_t stepper_target_pos_x = stepper_actual_pos_x;
			
			switch (current_run_mode) {
				case	run_mode_follow_zx:
				case	run_mode_follow_x: {
							stepper_target_pos_x = libdivide::libdivide_s64_do(absolute_actual_pos * stepper_follow_mul_x, &stepper_follow_div_x_opt);
						} break;
				case	run_mode_jog_zx:	
				case	run_mode_jog_x:	{
							if (--stepper_jog_tck_x <= 0) {
								// Reset
								stepper_jog_tck_x = stepper_jog_tim_x;
								// Advance
								if (stepper_jog_dir_x < 0) {
									stepper_target_pos_x --;
								}
								if (stepper_jog_dir_x > 0) {
									stepper_target_pos_x ++;
								}
							}
						} break;
				default: {
						} break;
			}

			int32_t sxdelta =  (int32_t)(stepper_target_pos_x - stepper_actual_pos_x);

			if (abs(sxdelta) >= 2880) {
				error_state_out_of_sync = sxdelta;
			}

			if (sxdelta == 0) {
				// nop
			} else if (sxdelta < 0) {
				if (stepper_dir_x != -1) {
					stepper_dir_x = -1;
				    GPIOB->BSRR = GPIO_BSRR_BR5;
					// wait until next cycle to do the pulse
				} else {
					stepper_actual_pos_x--;
					GPIOB->BSRR = GPIO_BSRR_BS11;
					flip_x ^= 1;
				}
			} else if (sxdelta > 0) {
				if (stepper_dir_x != +1) {
					stepper_dir_x = +1;
				    GPIOB->BSRR = GPIO_BSRR_BS5;
					// wait until next cycle to do the pulse
				} else {
					// now do the actual pulse
					stepper_actual_pos_x++;
					GPIOB->BSRR = GPIO_BSRR_BS11;
					flip_x ^= 1;
				}
			}
		} else {
			GPIOB->BSRR = GPIO_BSRR_BR11;
			flip_x ^= 1;
		}
	}
}

void TIM3_IRQHandler(void)
{
	if ((TIM3->SR & TIM_SR_UIF)) {
		TIM3->SR &= ~(TIM_SR_UIF);
	}
}

void TIM4_IRQHandler(void)
{
	if ((TIM4->SR & TIM_SR_UIF)) {
		TIM4->SR &= ~(TIM_SR_UIF);
	}
}

#ifdef __cplusplus
} // extern "C" {
#endif  // #ifdef __cplusplus

static void reset_stepper_offset_to_current_pos()
{
	// Protect against TIM3 IRQ race
	__disable_irq();
	int16_t cnt = TIM3->CNT;
	int64_t absolute_actual_pos = absolute_pos;
	__enable_irq();

	absolute_pos_start_offset = absolute_actual_pos - cnt;
}

static void maybe_enable_steppers()
{
	if (current_run_mode == run_mode_none) {
		// Z axis
		GPIOB->BSRR = GPIO_BSRR_BS12; // set to high disables driver
		// X axis
		GPIOB->BSRR = GPIO_BSRR_BS15; // set to high disables driver
		return;
	}

