tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
	switch (current_run_mode) {
		case	run_mode_follow_z: {
					// X axis
					GPIOB->BSRR = GPIO_BSRR_BS15; // set to high disables driver
					// Z axis
					GPIOB->BSRR = GPIO_BSRR_BR12; // set to low enables driver
				} break;
		case	run_mode_follow_x: {
					// Z axis
					GPIOB->BSRR = GPIO_BSRR_BS12; // set to high disables driver
					// X axis
					GPIOB->BSRR = GPIO_BSRR_BR15; // set to low enables driver
				} break;
		default: {
					// X axis
					GPIOB->BSRR = GPIO_BSRR_BR15; // set to low enables driver
					// Z axis
					GPIOB->BSRR = GPIO_BSRR_BR12; // set to low enables driver
				} break;
	}
}

static void set_current_run_mode(run_mode mode)
{
	reset_stepper_offset_to_current_pos();
	current_run_mode = mode;
	switch (current_run_mode) {
		case	run_mode_follow_zx: 
		case	run_mode_follow_z: 
		case	run_mode_follow_x: {
					wait_for_index_zero = 1;
					index_zero_occured = 0;
				} break;
		default: {
				} break;
	}
	maybe_enable_steppers();
}

static void init_constants() 
{
	absolute_pos = 0;
	absolute_idx = 0;
	absolute_tick = 0;
	current_rpm = 0; 

	absolute_pos_start_offset = 0;

	stepper_actual_pos_z = 0;
	stepper_dir_z = 0; // direction is undefined by default
	
	stepper_follow_mul_z = 3200 / 4;
	stepper_follow_div_z = 2800;
	stepper_follow_div_z_opt = libdivide::libdivide_s64_gen(stepper_follow_div_z);
	
	stepper_jog_dir_z = 0; // direction is undefined by default
	stepper_jog_tck_z = 100;
	stepper_jog_tim_z = 100;

	stepper_actual_pos_x = 0;
	stepper_dir_x = 0; // direction is undefined by default
	
	stepper_follow_mul_x = 3200 / 4;
	stepper_follow_div_x = 2880;
	stepper_follow_div_x_opt = libdivide::libdivide_s64_gen(stepper_follow_div_x);

	stepper_jog_dir_x = 0; // direction is undefined by default
	stepper_jog_tck_x = 100;
	stepper_jog_tim_x = 100;
	
	set_current_run_mode(run_mode_follow_z);
}

static void init_systick(void)
{
    int tick_time = SystemCoreClock / 1000;  // Generate interrupt each 1 ms
    SysTick_Config(tick_time);               // Configure systick timer
}

static void init_clock(void)
{
    // Conf clock : 72MHz using HSE 8MHz crystal w/ PLL X 9 (8MHz x 9 = 72MHz)
    FLASH->ACR      |= FLASH_ACR_LATENCY_2; // Two wait states, per datasheet
    RCC->CFGR       |= RCC_CFGR_PPRE1_2;    // prescale AHB1 = HCLK/2
    RCC->CR         |= RCC_CR_HSEON;        // enable HSE clock
    while( !(RCC->CR & RCC_CR_HSERDY) );    // wait for the HSEREADY flag
    
    RCC->CFGR       |= RCC_CFGR_PLLSRC;     // set PLL source to HSE
    RCC->CFGR       |= RCC_CFGR_PLLMULL9;   // multiply by 9
    RCC->CR         |= RCC_CR_PLLON;        // enable the PLL
    while( !(RCC->CR & RCC_CR_PLLRDY) );    // wait for the PLLRDY flag
    
    RCC->CFGR       |= RCC_CFGR_SW_PLL;     // set clock source to pll

    while( !(RCC->CFGR & RCC_CFGR_SWS_PLL) );    // wait for PLL to be CLK
    
    SystemCoreClockUpdate();                // calculate the SYSCLOCK value
}

static void init_led(void)
{
    RCC->APB2ENR        |= LED_CLOCK;               // enable GPIO clock for LED
    LED_PORT->LED_CR    &= ~(LED_PORT_RESET_BITS);  // reset pin MODE / CNF
    LED_PORT->LED_CR    |=  (LED_PORT_SET_BITS);    // MODE: 50Mhz ouput CNF: PP
}

static void init_usart(uint32_t baudrate)
{
	// UART on pins PB6 and PB7
	RCC->APB2ENR    |= RCC_APB2ENR_AFIOEN;  // enable AFIO clock
    RCC->APB2ENR    |= RCC_APB2ENR_IOPAEN | RCC_APB2ENR_IOPBEN | RCC_APB2ENR_IOPCEN;// enable GPIOA, GPIOB, GPIOC clock
    RCC->APB2ENR    |= RCC_APB2ENR_USART1EN;    // enable USART1 clock

    //use AFIO_MAPR register to remap alternate functions to use USART 1 TX and RX on PB6 and PB7
    //Ref 7.4.2 and 6.3.7 in st manual
    AFIO->MAPR |= AFIO_MAPR_USART1_REMAP;
    
    GPIOB->CRL &= ~(GPIO_CRL_CNF6 | GPIO_CRL_MODE6);  // reset PB6
    GPIOB->CRL &= ~(GPIO_CRL_CNF7 | GPIO_CRL_MODE7);  // reset PB7
    
    GPIOB->CRL |= GPIO_CRL_MODE6_1 | GPIO_CRL_MODE6_0;  // 0b11 50MHz output

    GPIOB->CRL |= GPIO_CRL_CNF6_1;    // PB6: output @ 50MHz - Alt-function Push-pull
    GPIOB->CRL |= GPIO_CRL_CNF7_0;    // PB7 RX - Mode = 0b00 (input) - CNF = 0b01 (input floating)
    
    // configure USART1 registers
    uint32_t baud   = (uint32_t)(SystemCoreClock/baudrate);
    USART1->BRR     = baud;
    USART1->CR1     = USART_CR1_TE | USART_CR1_RE | USART_CR1_RXNEIE | USART_CR1_UE;
    
    // configure NVIC
    NVIC_EnableIRQ(USART1_IRQn);
	NVIC_SetPriority(USART1_IRQn, 255);
}

static void init_qenc()
{
	// setup A/B quadrature on timer 3 periph

	RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;  // enable TIM3 clock

    GPIOA->CRL &= ~(GPIO_CRL_CNF6 | GPIO_CRL_MODE6);  // reset PA8
    GPIOA->CRL &= ~(GPIO_CRL_CNF7 | GPIO_CRL_MODE7);  // reset PA9

    GPIOA->CRL |= GPIO_CRL_CNF6_1;
    GPIOA->CRL |= GPIO_CRL_CNF7_1;

	TIM3->SR = 0;
	TIM3->CNT = 0;

	TIM3->CCMR1 &= ~(TIM_CCMR1_CC1S); 
	TIM3->CCMR1 |= TIM_CCMR1_CC1S_0; // connect TI1

	TIM3->CCMR1 &= ~(TIM_CCMR1_CC2S);
	TIM3->CCMR1 |= TIM_CCMR1_CC2S_0; // connect TI2

	TIM3->CCER &= ~(TIM_CCER_CC1P);  
	TIM3->CCER &= ~(TIM_CCER_CC1NP); 

	TIM3->CCER &= ~(TIM_CCER_CC2P);
	TIM3->CCER &= ~(TIM_CCER_CC2NP); 

	TIM3->SMCR &= ~(TIM_SMCR_SMS);
	TIM3->SMCR |= TIM_SMCR_SMS_0 | TIM_SMCR_SMS_1;

	TIM3->CR1  |= TIM_CR1_CEN; // turn on counter

    NVIC_EnableIRQ(TIM3_IRQn);
	NVIC_SetPriority(TIM3_IRQn, 3);

	// setup Z/Index on pin PA1

	RCC->APB2ENR    |= RCC_APB2ENR_AFIOEN;  // enable AFIO clock

	AFIO->EXTICR[0] |= AFIO_EXTICR1_EXTI1_PA; // Select EXT1

	EXTI->IMR |= EXTI_IMR_MR1;
	EXTI->FTSR |= EXTI_FTSR_TR1;

    // configure NVIC
    NVIC_EnableIRQ(EXTI1_IRQn);
	NVIC_SetPriority(EXTI1_IRQn, 0); // highest/critical priority in system
}

static void init_stepper_pins()
{
	RCC->APB2ENR |= RCC_APB2ENR_IOPBEN | RCC_APB2ENR_IOPAEN; // Enable GPIOB and GPIOA block

	// Z - enable
	GPIOB->CRH &= ~(GPIO_CRH_MODE12 | GPIO_CRH_CNF12);
    GPIOB->CRH |= GPIO_CRH_MODE12_1 | GPIO_CRH_MODE12_0;
    GPIOB->BSRR = GPIO_BSRR_BR12; // set to low enables driver

	// Z - pulse/step
	GPIOB->CRH &= ~(GPIO_CRH_MODE13 | GPIO_CRH_CNF13);
    GPIOB->CRH |= GPIO_CRH_MODE13_1 | GPIO_CRH_MODE13_0;
    GPIOB->BSRR = GPIO_BSRR_BS13;

	// Z - dir
	GPIOB->CRH &= ~(GPIO_CRH_MODE14 | GPIO_CRH_CNF14);
    GPIOB->CRH |= GPIO_CRH_MODE14_1 | GPIO_CRH_MODE14_0;
    GPIOB->BSRR = GPIO_BSRR_BS14;

	// X - enable
	GPIOB->CRH &= ~(GPIO_CRH_MODE15 | GPIO_CRH_CNF15);
    GPIOB->CRH |= GPIO_CRH_MODE15_1 | GPIO_CRH_MODE15_0;
    GPIOB->BSRR = GPIO_BSRR_BR15; // set to low enables driver

