tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
	// X - pulse/step
	GPIOB->CRH &= ~(GPIO_CRH_MODE11 | GPIO_CRH_CNF11);
    GPIOB->CRH |= GPIO_CRH_MODE11_1 | GPIO_CRH_MODE11_0;
    GPIOB->BSRR = GPIO_BSRR_BS11;

	// X - dir
	GPIOB->CRL &= ~(GPIO_CRL_MODE5 | GPIO_CRL_CNF5);
    GPIOB->CRL |= GPIO_CRL_MODE5_1 | GPIO_CRL_MODE5_0;
    GPIOB->BSRR = GPIO_BSRR_BS5;
}

static void init_stepper_sync_timer()
{
	RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;  // enable TIM3 clock

    TIM2->CR1 |= TIM_CR1_ARPE | TIM_CR1_URS;
    TIM2->PSC = 1;
    TIM2->ARR = 500; // This seems to be working fine at 1200rpm and 1:1 ratio
    TIM2->DIER |= TIM_DIER_UIE;
    TIM2->EGR = TIM_EGR_UG; // Generate Update Event to copy ARR to its shadow
    TIM2->CR1 |= TIM_CR1_CEN;

    NVIC_EnableIRQ(TIM2_IRQn);
	NVIC_SetPriority(TIM2_IRQn, 1); // second highest priority in system
}

static void init_jog_timer()
{
	RCC->APB1ENR |= RCC_APB1ENR_TIM4EN;  // enable TIM3 clock

    TIM4->CR1 |= TIM_CR1_ARPE | TIM_CR1_URS;
    TIM4->PSC = 1;
    TIM4->ARR = 32768;
    TIM4->DIER |= TIM_DIER_UIE;
    TIM4->EGR = TIM_EGR_UG; // Generate Update Event to copy ARR to its shadow
    TIM4->CR1 |= TIM_CR1_CEN;

    NVIC_EnableIRQ(TIM4_IRQn);
	NVIC_SetPriority(TIM4_IRQn, 2); // third highest priority in system
}

static void init_hardware(void)
{ 
	init_constants();
    init_clock();
    init_led();
    init_usart(USART_BAUD);
    init_systick();
	init_qenc();
	init_stepper_pins();
	init_stepper_sync_timer();
	init_jog_timer();
}

static void led_heartbeat(void)
{
    switch(led_state)
    {
        case led_on:
            led_state       = led_idle;
            led_state_next  = led_off;
            LED_PORT->BSRR  = LED_SET;
            break;
            
        case led_off:
            led_state       = led_idle;
            led_state_next  = led_on;
            LED_PORT->BSRR  = LED_RESET;
            break;
            
        default:
            break;
    }
}

int main(void) 
{
    init_hardware();
	while (1) {
		led_heartbeat();
		__WFI();
    }
    return 0;
}

